content/309.2_CE311_Spring2026.org
#+TITLE: CE 311: Design of Reinforced Concrete Structures - Spring 2026
# #+OPTIONS: 
#+OPTIONS: toc:1
#+MACRO: mtime (eval (format-time-string "%d-%B-%Y" (nth 5 (file-attributes buffer-file-name))))

* Basic Information
|-------------------+-------------------------------------------+-----------------------------------------------------|
|                   | Theory                                    | Laboratory                                          |
|-------------------+-------------------------------------------+-----------------------------------------------------|
| Class time        | Tuesday, Friday, 11:30-12:50 hrs          | Thursday, 17:00-18:20 hrs                           |
| Class location    | AB 7/103                                  | AB 6/102                                            |
|-------------------+-------------------------------------------+-----------------------------------------------------|
| Instructor        | Gaurav Srivastava (gauravs@iitgn.ac.in)   | Siva Chopperla (siva.chopperla@iitgn.ac.in)         |
|-------------------+-------------------------------------------+-----------------------------------------------------|
| Tutorial time     | Thursday, 15:30-16:50 hrs                 | Thursday, 15:30-16:50 hrs                           |
| Tutorial location | AB 7/206                                  | AB 7/206                                            |
|-------------------+-------------------------------------------+-----------------------------------------------------|
| TAs               | Kritika Rai (kritika.rai@iitgn.ac.in)     | Venkata Valligatla (venkata.valligatla@iitgn.ac.in) |
|                   | Shivam Gautam (shivam.gautam@iitgn.ac.in) | Shaivi Sargam Chanekar (24250084@iitgn.ac.in)       |
|-------------------+-------------------------------------------+-----------------------------------------------------|
*Note*:
1. Tutorial hours will be used for problem-solving, covering theoretical aspects of the laboratory, and hands-on laboratory experiments, as relevant for the topics being covered.
2. The remainder of this website has information pertaining to the theory part of the course.
3. The laboratory part of the course will use a Google Classroom (Code: jcomhstt). More information is available here ([[https://drive.google.com/file/d/1jkhLhwoGvPd5Ji0L_EWncFiR8o-EfzSa/view?usp=sharing][link to PDF]]).
4. Assignments and tutorials will be posted in this [[https://drive.google.com/drive/folders/1FFy2mhmzlJjk1cDJ6ZzLTR_JR9H3c3Tv?usp=sharing][Google folder]].

* Course objectives, syllabus, books, pre-requisites
** Objectives
- To learn the fundamentals of analyzing reinforced concrete structural members.
- To learn design of basic structural members of a reinforced concrete building.
- To learn overall structual design of a reinforced concrete building.
	
** Syllabus
- Properties of concrete and steel.
- Design philosophies.
- Loads and load combinations.
- Analysis and design of beams, columns, slabs, stair case and shallow foundations.
- Ductile detailing.
- (if time permits: ) design of shear walls, seismic design.

		
** Textbook
- Reinforced Concrete Design - S Unnikrishna Pillai and Devdas Menon.
# comment
	
** Reference Book
- Limit State Design of Reinforced Concrete Structures - P C Verghese.

** Required codes
- IS 456(2000): Plain and reinforced concrete - Code of Practice
- IS 875-1(1987): Code of practice for design loads (other than earthquake) for buildings and structures [Dead Loads]
- IS 875-2(1987): Code of practice for design loads (other than earthquake) for buildings and structures [Imposed Loads]
- IS 875-3(2015): Code of practice for design loads (other than earthquake) for buildings and structures [Wind Loads]
- SP 16(1980): Design aids for reinforced concrete to IS 456

*Note*:
- Please have a printed copy of the codes available during classes, tutorials and exams.
- During the exams, only printed copies of the codes will be allowed.

** Pre-requisites
- Good background in Mechanics of Solids.
- Good background in Structural Analysis.
- Curiosity to learn the fundamentals behind construction of some of the largest structures like Hoover Dam and Burj Khalifa.

* Course Policies
** Etiquette
- Please be considerate about everyone's time.
- In all emails pertaining to this course, please have "CE311" in the subject line.
	- (note that there is no space or hyphen or anything between CE and 311)

** Cheating
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.

** Grading
- Theory part comprises of 70% of the overall grading (remaining 30% is for laboratory)
- Following will be the weightage of different components of assessment for the theory part
| Component            | Weightage |
|----------------------+-----------|
| Homework assignments |       25% |
| In-class submissions |       15% |
| Exams (two)          |  15% each |

** Modes of formal assessment
- Assignments will involve two types of problems:
  - Set A: to be submitted for grading
  - Set B: to be practiced and will not be graded (this is treated as tutorial; help will be available from the TAs/instructor for solving, if needed)
- In-class submissions entail submitting solutions to small problems given in the class (submission days will not be announced)
- Exams will involve take home type analysis/design problems along with viva/presentations.
- Expect one assignment per week.
- Assignments and tutorials will be posted in this [[https://drive.google.com/drive/folders/1FFy2mhmzlJjk1cDJ6ZzLTR_JR9H3c3Tv?usp=sharing][Google folder]].
	
** Emphasis on self-learning
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.

* Calendar (tentative)
** [L1] Jan 06, Tue
- Introduction to design. Components of building. Load path.
- Design variables, economics, and such considerations.
- Introduction to codes that will be used.
- Refer to Chapter 1 of the textbook.
** [L2] Jan 09, Fri
- Consideration of loads. Discussion of IS 875 (parts 1, 2 and 3).
** [L3] Jan 13, Tue
- Visit to housing construction site, IITGN.
** [L4] Jan 16, Fri
- Material properties of concrete and steel.
- Methods of design (WSM, ULM, LSM).
- Idea of reliability-based design. Characteristic load and strength.
- Partial safety factors.
- Limit states of collapse and serviceability.
- Refer to Chapters 2 and 3 of the textbook.
** [L5] Jan 20, Tue
- Limit state of collapse in flexure.
- Assumptions in flexural analysis and design. Design strength curves for concrete and steel.
- Consideration of singly-reinforced RCC section under flexure.
  - Idea of balanced failure. 
  - Derivation of expressions for $x_u$, $x_{u,max}/d$, $M_{uR}$, $M_{u,lim}$, $M_u/bd^2$, $p_{t,lim}$.
  - Under-reinforced and over-reinforced sections.
- Design of rectangular, singly-reinforced beams.
  - Choosing grade of concrete and cover
  - Sizing (b, D) and determination of tension steel to be provided
- Refer to Chapters 4 and 5 of the textbook.
** [L6] Jan 23, Fri
- Design of rectangular, singly-reinforced beams.
  - design for strength (limit state of collapse)
  - consideration of serviceability (deflections, crack width)
  - $l/d$ ratios and their limits
- Analysis and design of doubly-reinforced beams
  - additional tension steel and corresponding compression steel
- Refer to Chapters 4 and 5 of the textbook.
** [L7] Jan 27, Tue
- Design of doubly-reinforced beams
  - additional tension steel and corresponding compression steel
- Limits on bar spacing and their impact on crack width
- Refer to Chapters 4 and 5 of the textbook.
** [L8] Jan 30, Fri
- *Assignment 1* [[https://drive.google.com/drive/folders/1FFy2mhmzlJjk1cDJ6ZzLTR_JR9H3c3Tv?usp=sharing][given here]] (due 6 Feb)
- Design of beams for shear
- Refer to Chapter 6 of the textbook.
** [L9] Feb 03, Tue
- Critical sections for moment and shear
- Consideration of flanged-beams (T and L)
- Refer to Chapters 4 and 5 of the textbook.
** [T1] Feb 05, Thu
- Design of beams.
** [L10] Feb 06, Fri
- Design of columns.
** [L11] Feb 10, Tue
- Design of columns.
** [T2] Feb 12, Thu
- Design of columns.
** [L12] Feb 13, Fri
- Design of slabs.
** [L13] Feb 17, Tue
- Design of slabs.
** Feb 20 - 27: Mid semester exam week
** Feb 28 - Mar 8: Mid semester recess
** [L14] Mar 10, Tue
- Design of shallow foundations.
- Types of footings, eccentricity, failure modes and design considerations.
** [L15] Mar 13, Fri
- Design of shallow foundations.
** [L16] Mar 17, Tue
- Design of staircases.
** [T3] Mar 19, Thu
- Design of foundations.
** [L17] Mar 20, Fri
- Design of staircases.
** [L18] Mar 24, Tue
- Design of structural systems.
** [T4] Mar 26, Thu
- Design of staircases.
** [L19] Mar 30, Mon
- Design of structural systems.
** Mar 31, Tue - no class
- Mahavir Jayanti
** [T5] Apr 02, Thu
- Design of structural systems.
** Apr 03, Fri - no class
- Good Friday
** [L20] Apr 07, Tue
- Ductile detailing and construction practices.
** [L21] Apr 10, Fri
- Ductile detailing and construction practices.
** [L22] Apr 14, Tue
- Ductile detailing and construction practices.
** [T6] Apr 16, Thu
- Design of structural systems.
** [L23] Apr 17, Fri
- Ductile detailing and construction practices.
** [L24] Apr 21, Tue
- Ductile detailing and construction practices.
** [T7] Apr 23, Thu
- Ductile detailing and construction practices.
** Apr 24 - May 01: End semester exam week


#+HTML: <small>
(Last updated: {{{mtime}}})
#+HTML: </small>
