309.2_CE311_Spring2026.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-06 Fri 04:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CE 311: Design of Reinforced Concrete Structures - Spring 2026</title>
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' href='gs_simple.css' />

</head>
<body>
<div id="preamble" class="status">

<center>
<nav>
<a href="/index.html">Home</a>
<a href="/research.html">Research</a>
<a href="/teaching.html">Teaching</a>
<a href="/students.html">Students</a>
</nav>
</center>
</div>
<div id="content" class="content">
<h1 class="title">CE 311: Design of Reinforced Concrete Structures - Spring 2026</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org71a0b46">Basic Information</a></li>
<li><a href="#org28a102a">Course objectives, syllabus, books, pre-requisites</a></li>
<li><a href="#org81c40f1">Course Policies</a></li>
<li><a href="#org79c0c6b">Calendar (tentative)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org71a0b46" class="outline-2">
<h2 id="org71a0b46">Basic Information</h2>
<div class="outline-text-2" id="text-org71a0b46">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Theory</th>
<th scope="col" class="org-left">Laboratory</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Class time</td>
<td class="org-left">Tuesday, Friday, 11:30-12:50 hrs</td>
<td class="org-left">Thursday, 17:00-18:20 hrs</td>
</tr>

<tr>
<td class="org-left">Class location</td>
<td class="org-left">AB 7/103</td>
<td class="org-left">AB 6/102</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Gaurav Srivastava (gauravs@iitgn.ac.in)</td>
<td class="org-left">Siva Chopperla (siva.chopperla@iitgn.ac.in)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tutorial time</td>
<td class="org-left">Thursday, 15:30-16:50 hrs</td>
<td class="org-left">Thursday, 15:30-16:50 hrs</td>
</tr>

<tr>
<td class="org-left">Tutorial location</td>
<td class="org-left">AB 7/206</td>
<td class="org-left">AB 7/206</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TAs</td>
<td class="org-left">Kritika Rai (kritika.rai@iitgn.ac.in)</td>
<td class="org-left">Venkata Valligatla (venkata.valligatla@iitgn.ac.in)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Shivam Gautam (shivam.gautam@iitgn.ac.in)</td>
<td class="org-left">Shaivi Sargam Chanekar (24250084@iitgn.ac.in)</td>
</tr>
</tbody>
</table>
<p>
<b>Note</b>:
</p>
<ol class="org-ol">
<li>Tutorial hours will be used for problem-solving, covering theoretical aspects of the laboratory, and hands-on laboratory experiments, as relevant for the topics being covered.</li>
<li>The remainder of this website has information pertaining to the theory part of the course.</li>
<li>The laboratory part of the course will use a Google Classroom (Code: jcomhstt). More information is available here (<a href="https://drive.google.com/file/d/1jkhLhwoGvPd5Ji0L_EWncFiR8o-EfzSa/view?usp=sharing">link to PDF</a>).</li>
<li>Assignments and tutorials will be posted in this <a href="https://drive.google.com/drive/folders/1FFy2mhmzlJjk1cDJ6ZzLTR_JR9H3c3Tv?usp=sharing">Google folder</a>.</li>
</ol>
</div>
</div>

<div id="outline-container-org28a102a" class="outline-2">
<h2 id="org28a102a">Course objectives, syllabus, books, pre-requisites</h2>
<div class="outline-text-2" id="text-org28a102a">
</div>
<div id="outline-container-org8944803" class="outline-3">
<h3 id="org8944803">Objectives</h3>
<div class="outline-text-3" id="text-org8944803">
<ul class="org-ul">
<li>To learn the fundamentals of analyzing reinforced concrete structural members.</li>
<li>To learn design of basic structural members of a reinforced concrete building.</li>
<li>To learn overall structual design of a reinforced concrete building.</li>
</ul>
</div>
</div>

<div id="outline-container-orge1313da" class="outline-3">
<h3 id="orge1313da">Syllabus</h3>
<div class="outline-text-3" id="text-orge1313da">
<ul class="org-ul">
<li>Properties of concrete and steel.</li>
<li>Design philosophies.</li>
<li>Loads and load combinations.</li>
<li>Analysis and design of beams, columns, slabs, stair case and shallow foundations.</li>
<li>Ductile detailing.</li>
<li>(if time permits: ) design of shear walls, seismic design.</li>
</ul>
</div>
</div>


<div id="outline-container-org5d21fe6" class="outline-3">
<h3 id="org5d21fe6">Textbook</h3>
<div class="outline-text-3" id="text-org5d21fe6">
<ul class="org-ul">
<li>Reinforced Concrete Design - S Unnikrishna Pillai and Devdas Menon.</li>
</ul>
</div>
</div>

<div id="outline-container-org59f4819" class="outline-3">
<h3 id="org59f4819">Reference Book</h3>
<div class="outline-text-3" id="text-org59f4819">
<ul class="org-ul">
<li>Limit State Design of Reinforced Concrete Structures - P C Verghese.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbbe151f" class="outline-3">
<h3 id="orgbbe151f">Required codes</h3>
<div class="outline-text-3" id="text-orgbbe151f">
<ul class="org-ul">
<li>IS 456(2000): Plain and reinforced concrete - Code of Practice</li>
<li>IS 875-1(1987): Code of practice for design loads (other than earthquake) for buildings and structures [Dead Loads]</li>
<li>IS 875-2(1987): Code of practice for design loads (other than earthquake) for buildings and structures [Imposed Loads]</li>
<li>IS 875-3(2015): Code of practice for design loads (other than earthquake) for buildings and structures [Wind Loads]</li>
<li>SP 16(1980): Design aids for reinforced concrete to IS 456</li>
</ul>

<p>
<b>Note</b>:
</p>
<ul class="org-ul">
<li>Please have a printed copy of the codes available during classes, tutorials and exams.</li>
<li>During the exams, only printed copies of the codes will be allowed.</li>
</ul>
</div>
</div>

<div id="outline-container-org2c7d491" class="outline-3">
<h3 id="org2c7d491">Pre-requisites</h3>
<div class="outline-text-3" id="text-org2c7d491">
<ul class="org-ul">
<li>Good background in Mechanics of Solids.</li>
<li>Good background in Structural Analysis.</li>
<li>Curiosity to learn the fundamentals behind construction of some of the largest structures like Hoover Dam and Burj Khalifa.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org81c40f1" class="outline-2">
<h2 id="org81c40f1">Course Policies</h2>
<div class="outline-text-2" id="text-org81c40f1">
</div>
<div id="outline-container-org966b054" class="outline-3">
<h3 id="org966b054">Etiquette</h3>
<div class="outline-text-3" id="text-org966b054">
<ul class="org-ul">
<li>Please be considerate about everyone's time.</li>
<li>In all emails pertaining to this course, please have "CE311" in the subject line.
<ul class="org-ul">
<li>(note that there is no space or hyphen or anything between CE and 311)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6f24a5d" class="outline-3">
<h3 id="org6f24a5d">Cheating</h3>
<div class="outline-text-3" id="text-org6f24a5d">
<p>
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.
</p>
</div>
</div>

<div id="outline-container-orgd4d7d31" class="outline-3">
<h3 id="orgd4d7d31">Grading</h3>
<div class="outline-text-3" id="text-orgd4d7d31">
<ul class="org-ul">
<li>Theory part comprises of 70% of the overall grading (remaining 30% is for laboratory)</li>
<li>Following will be the weightage of different components of assessment for the theory part</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-right">Weightage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Homework assignments</td>
<td class="org-right">25%</td>
</tr>

<tr>
<td class="org-left">In-class submissions</td>
<td class="org-right">15%</td>
</tr>

<tr>
<td class="org-left">Exams (two)</td>
<td class="org-right">15% each</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7fb8e3f" class="outline-3">
<h3 id="org7fb8e3f">Modes of formal assessment</h3>
<div class="outline-text-3" id="text-org7fb8e3f">
<ul class="org-ul">
<li>Assignments will involve two types of problems:
<ul class="org-ul">
<li>Set A: to be submitted for grading</li>
<li>Set B: to be practiced and will not be graded (this is treated as tutorial; help will be available from the TAs/instructor for solving, if needed)</li>
</ul></li>
<li>In-class submissions entail submitting solutions to small problems given in the class (submission days will not be announced)</li>
<li>Exams will involve take home type analysis/design problems along with viva/presentations.</li>
<li>Expect one assignment per week.</li>
<li>Assignments and tutorials will be posted in this <a href="https://drive.google.com/drive/folders/1FFy2mhmzlJjk1cDJ6ZzLTR_JR9H3c3Tv?usp=sharing">Google folder</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org13167a9" class="outline-3">
<h3 id="org13167a9">Emphasis on self-learning</h3>
<div class="outline-text-3" id="text-org13167a9">
<p>
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.
</p>
</div>
</div>
</div>

<div id="outline-container-org79c0c6b" class="outline-2">
<h2 id="org79c0c6b">Calendar (tentative)</h2>
<div class="outline-text-2" id="text-org79c0c6b">
</div>
<div id="outline-container-orgb142546" class="outline-3">
<h3 id="orgb142546">[L1] Jan 06, Tue</h3>
<div class="outline-text-3" id="text-orgb142546">
<ul class="org-ul">
<li>Introduction to design. Components of building. Load path.</li>
<li>Design variables, economics, and such considerations.</li>
<li>Introduction to codes that will be used.</li>
<li>Refer to Chapter 1 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-orgceb4498" class="outline-3">
<h3 id="orgceb4498">[L2] Jan 09, Fri</h3>
<div class="outline-text-3" id="text-orgceb4498">
<ul class="org-ul">
<li>Consideration of loads. Discussion of IS 875 (parts 1, 2 and 3).</li>
</ul>
</div>
</div>
<div id="outline-container-org3936ae3" class="outline-3">
<h3 id="org3936ae3">[L3] Jan 13, Tue</h3>
<div class="outline-text-3" id="text-org3936ae3">
<ul class="org-ul">
<li>Visit to housing construction site, IITGN.</li>
</ul>
</div>
</div>
<div id="outline-container-org456c555" class="outline-3">
<h3 id="org456c555">[L4] Jan 16, Fri</h3>
<div class="outline-text-3" id="text-org456c555">
<ul class="org-ul">
<li>Material properties of concrete and steel.</li>
<li>Methods of design (WSM, ULM, LSM).</li>
<li>Idea of reliability-based design. Characteristic load and strength.</li>
<li>Partial safety factors.</li>
<li>Limit states of collapse and serviceability.</li>
<li>Refer to Chapters 2 and 3 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-org259cf87" class="outline-3">
<h3 id="org259cf87">[L5] Jan 20, Tue</h3>
<div class="outline-text-3" id="text-org259cf87">
<ul class="org-ul">
<li>Limit state of collapse in flexure.</li>
<li>Assumptions in flexural analysis and design. Design strength curves for concrete and steel.</li>
<li>Consideration of singly-reinforced RCC section under flexure.
<ul class="org-ul">
<li>Idea of balanced failure.</li>
<li>Derivation of expressions for \(x_u\), \(x_{u,max}/d\), \(M_{uR}\), \(M_{u,lim}\), \(M_u/bd^2\), \(p_{t,lim}\).</li>
<li>Under-reinforced and over-reinforced sections.</li>
</ul></li>
<li>Design of rectangular, singly-reinforced beams.
<ul class="org-ul">
<li>Choosing grade of concrete and cover</li>
<li>Sizing (b, D) and determination of tension steel to be provided</li>
</ul></li>
<li>Refer to Chapters 4 and 5 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf961e94" class="outline-3">
<h3 id="orgf961e94">[L6] Jan 23, Fri</h3>
<div class="outline-text-3" id="text-orgf961e94">
<ul class="org-ul">
<li>Design of rectangular, singly-reinforced beams.
<ul class="org-ul">
<li>design for strength (limit state of collapse)</li>
<li>consideration of serviceability (deflections, crack width)</li>
<li>\(l/d\) ratios and their limits</li>
</ul></li>
<li>Analysis and design of doubly-reinforced beams
<ul class="org-ul">
<li>additional tension steel and corresponding compression steel</li>
</ul></li>
<li>Refer to Chapters 4 and 5 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-org9051169" class="outline-3">
<h3 id="org9051169">[L7] Jan 27, Tue</h3>
<div class="outline-text-3" id="text-org9051169">
<ul class="org-ul">
<li>Design of doubly-reinforced beams
<ul class="org-ul">
<li>additional tension steel and corresponding compression steel</li>
</ul></li>
<li>Limits on bar spacing and their impact on crack width</li>
<li>Refer to Chapters 4 and 5 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-orge84fbf4" class="outline-3">
<h3 id="orge84fbf4">[L8] Jan 30, Fri</h3>
<div class="outline-text-3" id="text-orge84fbf4">
<ul class="org-ul">
<li><b>Assignment 1</b> <a href="https://drive.google.com/drive/folders/1FFy2mhmzlJjk1cDJ6ZzLTR_JR9H3c3Tv?usp=sharing">given here</a> (due 6 Feb)</li>
<li>Design of beams for shear</li>
<li>Refer to Chapter 6 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-orgacf9c34" class="outline-3">
<h3 id="orgacf9c34">[L9] Feb 03, Tue</h3>
<div class="outline-text-3" id="text-orgacf9c34">
<ul class="org-ul">
<li>Critical sections for moment and shear</li>
<li>Consideration of flanged-beams (T and L)</li>
<li>Refer to Chapters 4 and 5 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-org5ec948b" class="outline-3">
<h3 id="org5ec948b">[T1] Feb 05, Thu</h3>
<div class="outline-text-3" id="text-org5ec948b">
<ul class="org-ul">
<li>Analysis and design of beams.</li>
<li><a href="https://drive.google.com/drive/folders/1FFy2mhmzlJjk1cDJ6ZzLTR_JR9H3c3Tv?usp=sharing">Download from here</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbb161e9" class="outline-3">
<h3 id="orgbb161e9">[L10] Feb 06, Fri</h3>
<div class="outline-text-3" id="text-orgbb161e9">
<ul class="org-ul">
<li>Design of columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org024ad86" class="outline-3">
<h3 id="org024ad86">[L11] Feb 10, Tue</h3>
<div class="outline-text-3" id="text-org024ad86">
<ul class="org-ul">
<li>Design of columns.</li>
</ul>
</div>
</div>
<div id="outline-container-orge9d5c91" class="outline-3">
<h3 id="orge9d5c91">[T2] Feb 12, Thu</h3>
<div class="outline-text-3" id="text-orge9d5c91">
<ul class="org-ul">
<li>Design of columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org8a417e1" class="outline-3">
<h3 id="org8a417e1">[L12] Feb 13, Fri</h3>
<div class="outline-text-3" id="text-org8a417e1">
<ul class="org-ul">
<li>Design of slabs.</li>
</ul>
</div>
</div>
<div id="outline-container-org0472028" class="outline-3">
<h3 id="org0472028">[L13] Feb 17, Tue</h3>
<div class="outline-text-3" id="text-org0472028">
<ul class="org-ul">
<li>Design of slabs.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc430afa" class="outline-3">
<h3 id="orgc430afa">Feb 20 - 27: Mid semester exam week</h3>
</div>
<div id="outline-container-orgd832f8e" class="outline-3">
<h3 id="orgd832f8e">Feb 28 - Mar 8: Mid semester recess</h3>
</div>
<div id="outline-container-org0e720c9" class="outline-3">
<h3 id="org0e720c9">[L14] Mar 10, Tue</h3>
<div class="outline-text-3" id="text-org0e720c9">
<ul class="org-ul">
<li>Design of shallow foundations.</li>
<li>Types of footings, eccentricity, failure modes and design considerations.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd07d9ed" class="outline-3">
<h3 id="orgd07d9ed">[L15] Mar 13, Fri</h3>
<div class="outline-text-3" id="text-orgd07d9ed">
<ul class="org-ul">
<li>Design of shallow foundations.</li>
</ul>
</div>
</div>
<div id="outline-container-org789c2a3" class="outline-3">
<h3 id="org789c2a3">[L16] Mar 17, Tue</h3>
<div class="outline-text-3" id="text-org789c2a3">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-org79449b3" class="outline-3">
<h3 id="org79449b3">[T3] Mar 19, Thu</h3>
<div class="outline-text-3" id="text-org79449b3">
<ul class="org-ul">
<li>Design of foundations.</li>
</ul>
</div>
</div>
<div id="outline-container-orge2b2593" class="outline-3">
<h3 id="orge2b2593">[L17] Mar 20, Fri</h3>
<div class="outline-text-3" id="text-orge2b2593">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-org31d3fd0" class="outline-3">
<h3 id="org31d3fd0">[L18] Mar 24, Tue</h3>
<div class="outline-text-3" id="text-org31d3fd0">
<ul class="org-ul">
<li>Design of structural systems.</li>
</ul>
</div>
</div>
<div id="outline-container-org77e738f" class="outline-3">
<h3 id="org77e738f">[T4] Mar 26, Thu</h3>
<div class="outline-text-3" id="text-org77e738f">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-org76f5972" class="outline-3">
<h3 id="org76f5972">[L19] Mar 30, Mon</h3>
<div class="outline-text-3" id="text-org76f5972">
<ul class="org-ul">
<li>Design of structural systems.</li>
</ul>
</div>
</div>
<div id="outline-container-org118b2dd" class="outline-3">
<h3 id="org118b2dd">Mar 31, Tue - no class</h3>
<div class="outline-text-3" id="text-org118b2dd">
<ul class="org-ul">
<li>Mahavir Jayanti</li>
</ul>
</div>
</div>
<div id="outline-container-org38c6256" class="outline-3">
<h3 id="org38c6256">[T5] Apr 02, Thu</h3>
<div class="outline-text-3" id="text-org38c6256">
<ul class="org-ul">
<li>Design of structural systems.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd45cff7" class="outline-3">
<h3 id="orgd45cff7">Apr 03, Fri - no class</h3>
<div class="outline-text-3" id="text-orgd45cff7">
<ul class="org-ul">
<li>Good Friday</li>
</ul>
</div>
</div>
<div id="outline-container-orge594cb5" class="outline-3">
<h3 id="orge594cb5">[L20] Apr 07, Tue</h3>
<div class="outline-text-3" id="text-orge594cb5">
<ul class="org-ul">
<li>Ductile detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf934e76" class="outline-3">
<h3 id="orgf934e76">[L21] Apr 10, Fri</h3>
<div class="outline-text-3" id="text-orgf934e76">
<ul class="org-ul">
<li>Ductile detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb320e3" class="outline-3">
<h3 id="orgeb320e3">[L22] Apr 14, Tue</h3>
<div class="outline-text-3" id="text-orgeb320e3">
<ul class="org-ul">
<li>Ductile detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org5773918" class="outline-3">
<h3 id="org5773918">[T6] Apr 16, Thu</h3>
<div class="outline-text-3" id="text-org5773918">
<ul class="org-ul">
<li>Design of structural systems.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf74941f" class="outline-3">
<h3 id="orgf74941f">[L23] Apr 17, Fri</h3>
<div class="outline-text-3" id="text-orgf74941f">
<ul class="org-ul">
<li>Ductile detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org719951f" class="outline-3">
<h3 id="org719951f">[L24] Apr 21, Tue</h3>
<div class="outline-text-3" id="text-org719951f">
<ul class="org-ul">
<li>Ductile detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org2deba39" class="outline-3">
<h3 id="org2deba39">[T7] Apr 23, Thu</h3>
<div class="outline-text-3" id="text-org2deba39">
<ul class="org-ul">
<li>Ductile detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org73cfd53" class="outline-3">
<h3 id="org73cfd53">Apr 24 - May 01: End semester exam week</h3>
<div class="outline-text-3" id="text-org73cfd53">
<small>
<p>
(Last updated: 06-February-2026)
</p>
</small>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<footer>
Contact:
<a href='mailto:gauravs@iitgn.ac.in'>gauravs@iitgn.ac.in</a> (Work) |
<a href='mailto:it.gaurav@gmail.com'>it.gaurav@gmail.com</a> (Personal)
<br>
Created completely through <a href='https://www.gnu.org/software/emacs/'>Gnu Emacs</a> and <a href='https://orgmode.org'>Org Mode</a> (<a href='https://github.com/gaurav-iitgn/gaurav-iitgn.github.io'>source code</a>)
</footer>
</div>
</body>
</html>
